Cheak for Missing values

In [ ]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
#df[df.isnull().any(axis=1)]

In [ ]:
#pd.set_option("display.max_rows",None)
#df[df['Age'].isnull()]

In [ ]:
df.iloc[6]

PassengerId                          7
Survived                             0
Pclass                               1
Name           McCarthy, Mr. Timothy J
Sex                               male
Age                               54.0
SibSp                                0
Parch                                0
Ticket                           17463
Fare                           51.8625
Cabin                              E46
Embarked                             S
Name: 6, dtype: object

In [ ]:
#df['Age'].fillna(df['Age'].mean())

In [ ]:
df.iloc[3]

PassengerId                                               4
Survived                                                  1
Pclass                                                    1
Name           Futrelle, Mrs. Jacques Heath (Lily May Peel)
Sex                                                  female
Age                                                    35.0
SibSp                                                     1
Parch                                                     0
Ticket                                               113803
Fare                                                   53.1
Cabin                                                  C123
Embarked                                                  S
Name: 3, dtype: object

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

a) Drop Rows or Columns

In [ ]:
#df.dropna(inplace=True)
#df.dropna(subset=['Age'])
#df.drop(columns=['Cabin'])

b) Fill with Static Value

In [ ]:
#df['Embarked'].fillna('Unknown')
#df['Age'].fillna(6)

Any Method

C) Fill wiht Mean, Median, Mode

In [ ]:
#df['Age'].fillna(df['Age'].mean())
#df['Age'].fillna(df['Age'].median())
#df['Embarked'].fillna(df['Embarked'].mode())

D) Forward/Bacword Fill

In [ ]:
#df.fillna(method='ffill')

In [ ]:
#df.fillna(method='bfill')

Encoding Catedorical Variables

In [ ]:
df.drop(columns=['Cabin'])
#df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])
df['Age'] = df['Age'].fillna(df['Age'].mean())

A) Lable encoding

In [ ]:
#from sklearn.preprocessing import LabelEncoder
#le = LabelEncoder()
#df['Sex'] = le.fit_transform(df['Sex'])
#df

b) One -Hot encoding

In [ ]:
#df = pd.get_dummies(df, columns=['Embarked'], drop_first=True)
#df

A) Standarscaler(Z-score normalization)

In [ ]:
#from sklearn.preprocessing import StandardScaler

#scaler = StandardScaler()
#df[['Age', 'Fare']] = scaler.fit_transform(df[['Age', 'Fare']])
#df

b) MimMaxScalar

In [ ]:
#from sklearn.preprocessing import MinMaxScaler
#scaler = MinMaxScaler()
#df[['Age', 'Fare']] = scaler.fit_transform(df[['Age', 'Fare']])
#df

c) RobustScalar

In [ ]:
#from sklearn.preprocessing import RobustScaler
#scaler = RobustScaler()
#df[['Age', 'Fare']] = scaler.fit_transform(df[['Age', 'Fare']])
#df